# ExportLayerTableIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLayerTableIterator Properties
ExportLayerTableIterator Class See Also
---
The ExportLayerTableIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExportLayerTableIterator Class
Autodesk.Revit.DB Namespace